taroko-batch-ecs/src/main/resources/TWMP/hceOneWayEndpoint_request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ecs="http://ecs.tcb-bank.com.tw/ecs-ws-bus/ws/ecs">
	<soapenv:Header>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
			<wsse:UsernameToken wsu:Id="UsernameToken-3751ea3613534127af3f4c759a8e493c">
				<wsse:Username>ecs</wsse:Username>
				<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest"></wsse:Password>
				<wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">C/WiGZ0tfAQjQh6osxN9Rg==</wsse:Nonce>
				<wsu:Created>2021-10-08T01:49:32.216Z</wsu:Created>
			</wsse:UsernameToken>
		</wsse:Security>
	</soapenv:Header>
	<soapenv:Body>
		<ecs:twmpOneWayEndpoint>
			<!--Optional:-->
			<Header>
				<ClientTraceID>21100801493200216HCE060</ClientTraceID>
				<SrcSystemID>ECS</SrcSystemID>
				<UserID>HCEUser001</UserID>
				<UserPwd>/ZMgGerQLY9z5nX9x6EJlIS3K2M=</UserPwd>
				<SessionID>00000</SessionID>
				<TxnID>HCEECS01</TxnID>
				<ClientDt>2021-10-08T01:49:32.216</ClientDt>
			</Header>
			<SvcRq xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="ecs:HCEECS01SvcRq">
				<InDate>1101008</InDate>
				<InTime>014932</InTime>
				<MsgType>0100</MsgType>
				<PrsCode>ISS01</PrsCode>
				<Stan>00000000000000</Stan>
				<Pan>5241220500090503</Pan>
				<MobileNo>0912345678</MobileNo>
				<DpReason>07</DpReason>
				<DpDateTime>20211008014932</DpDateTime>
				<PayScheme>0400</PayScheme>
				<WalletId></WalletId>
				<ServiceId></ServiceId>
				<ServiceVer></ServiceVer>
				<EventId>1</EventId>
				<SeType>05</SeType>
				<ActCode>26123456FFFFFFFF</ActCode>
				<ActCodeEnc>26123456FFFFFFFF</ActCodeEnc>
				<Track2DataEnc>5241220500090503D20012011277996600000F</Track2DataEnc>
				<PanSeq>00</PanSeq>
				<Tpan>3567138805442101</Tpan>
				<TpanExpdate>2110</TpanExpdate>
				<MemberID></MemberID>
				<BarcodeType>00</BarcodeType>
			</SvcRq>
		</ecs:twmpOneWayEndpoint>
	</soapenv:Body>
</soapenv:Envelope>